Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: འགྱོད་པའི་གཉེན་པོ་ནི་ཤེས་རབ་ཚོལ་བའོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands that the search for insight is the antidote to regret.

source: ཐེ་ཙོམ་གྱི་གཉེན་པོ་ནི་ཆོས་རྣམས་ལ་རྣམ་པར་ངེས་པ་ཁོང་དུ་ཆུད་པའོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands that knowing how to gain certainty with regard to phenomena is the antidote to doubt.

source: མི་དགའ་བའི་གཉེན་པོ་ནི་ཕན་ཡོན་སྟོན་པའོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands that being helpful is the antidote to sadness.

source: དགའ་བའི་གཉེན་པོ་ནི་བདག་བསྡུས་པའོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands that collecting oneself is the antidote to happiness.

source: གླལ་བའི་གཉེན་པོ་ནི་བརྩོན་འགྲུས་རྩོམ་པའོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands that being diligent is the antidote to sleepiness.

source: བཟའ་བ་མ་བསྡམས་པའི་གཉེན་པོ་ནི་ཟས་ལ་མི་འཐུན་པའི་འདུ་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands that disregarding food is the antidote to overeating.

source: ཀུན་ནས་ཉོན་མོངས་པའི་གཉེན་པོ་ནི་སེམས་རབ་ཏུ་བསྡུས་པའོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands that a composed mind is the antidote to disturbing emotions.

source: འདུ་ཤེས་སྣ་ཚོགས་ཀྱི་གཉེན་པོ་ནི་མཚན་མ་མེད་པའོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands that the absence of marks is the antidote to a proliferation of thoughts.

source: ཡིད་ལ་མི་བྱེད་པའི་གཉེན་པོ་ནི་ཆོས་རྣམས་ལ་དོན་དུ་བྱེད་པ་ཉིད་དོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands that engagement with phenomena is the antidote to a lack of attention.

source: ལུས་ཀྱི་གནས་ངན་ལེན་གྱི་གཉེན་པོ་ནི་སྡོམ་པའི་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands that restraint is the antidote to the unwholesome physical states.

source: ཆགས་པའི་གཉེན་པོ་ནི་དགེ་བའི་བཤེས་གཉེན་ལ་བརྟེན་པའོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands that following a spiritual teacher is the antidote to desire.

source: མུ་སྟེགས་ཀྱི་ཤེས་པ་ཉིད་དག་ལ་ཆགས་པའི་གཉེན་པོ་ནི་མི་འཐུན་པའི་འདུ་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: He correctly understands that being critical is the antidote to attraction toward the knowledge of the extremists.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྣམ་པར་བྱང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, in this way the Thus-Gone One correctly understands purification.

source: དེ་བཞིན་གཤེགས་པ་རྣམ་པར་བྱང་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of purification,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྣམ་པར་གཞག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of abiding.

source: འདི་ལྟར་བསམ་གཏན་དང་པོ་ལས་ལྡང་བར་བྱ་ཞིང་། བསམ་གཏན་དང་པོ་ལས་ལངས་ནས། ཆོས་འདི་དག་ལ་ཡང་དག་པར་སྤྱོད་པ་དེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands that one must arise from the first concentration and, having done that, correctly make use of these teachings.

source: བསམ་གཏན་དང་པོ་ལས་ལངས་པའི་སེམས་དབེན་པ་ལ་གཞོལ་བར་གྱུར་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands the disengaged mind that arises from the first concentration.

source: བསམ་གཏན་དང་པོ་ལས་ལངས་པའི་སེམས་དགའ་བར་བྱེད་པའི་ཆོས་གང་ཡིན་པ་དང་། བསམ་གཏན་དང་པོ་ལས་ལངས་པའི་མངོན་པར་རྗོད་པར་བྱེད་པའི་ཆོས་གང་ཡིན་པ་དང་། དེ་དང་པོའི་ཆོས་གང་ཡིན་པ་ཡང་དག་པར་སྤྱོད་པའི་ཆོས་དེ་དག་རབ་ཏུ་མཁྱེན།
en: He correctly understands the teaching that inspires the mind as it arises from the first concentration, the teaching that expresses how to arise from the first concentration, as well as the teaching that applies the qualities of the first concentration.

source: སེམས་གང་གཞོལ་བར་གྱུར་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands the mind that engages.

source: ཆོས་གང་དག་ལ་དགའ་བའི་ཆོས་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands those teachings in which the mind delights

source: གང་དག་ལ་མི་དགའ་བའི་ཆོས་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands [those teachings in which the mind delights] and those teachings in which the mind does not delight.

source: ཆོས་གང་ཡིད་ལ་བྱས་ཤིང་ལྡང་བ་དེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: He correctly understands the teaching that contemplates and arises from that state.

source: དེ་བཞིན་དུ་བསམ་གཏན་གཉིས་པ་དང་། གསུམ་པ་དང་། བསམ་གཏན་བཞི་པ་དང་། དེ་བཞིན་དུ་རྣམ་པར་ཐར་པ་རྣམས་དང་། དེ་བཞིན་དུ་ཏིང་ངེ་འཛིན་རྣམས་དང་། དེ་བཞིན་དུ་སྙོམས་པར་འཇུག་པ་རྣམས་ཀྱི་སྟེ།
en: The same applies to the second, third, and fourth concentration, as well as the liberations, the absorptions, and the various equilibriums.

source: དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྣམ་པར་ལྡང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: In this way the Thus-Gone One correctly understands the states of arising.

source: དེ་བཞིན་གཤེགས་པ་རྣམ་པར་ལྡང་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of arising,

source: བསྐལ་པར་ལན་གསུང་བ་ནས་རྒྱ་ཆེར་བྱ་སྟེ།
en: he can respond for an eon, and so forth,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སྔོན་གྱི་མཐའ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the past.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་སྔོན་གྱི་བསྐལ་པ་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the previous eons.

source: བསྐལ་པ་གང་མིང་དུ་བཏགས་པར་གྱུར་པ་དེ། རྐྱེན་གང་དག་གིས་མིང་དུ་བཏགས་ནས་ཡང་དག་པར་གནས་པའི་བསྐལ་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ།
en: [He correctly understands] the names of the eons, the circumstances for their names being given, and how they remained.

source: དཔེར་ན། བསྐལ་པ་བཟང་པོ་འདིའི་མིང་བསྐལ་པས་པད་མ་སྟོང་མཐོང་ཞེས་བཏགས་པ་དེ་བཞིན་དུ་བསྐལ་པ་དེ་དག་གི་སོ་སོ་རབ་ཏུ་མཁྱེན།
en: For example, just as he knows that this excellent eon is called ‘Vision of One Thousand Lotuses,’ he knows the names for each of the eons.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་མཚན་བཙུན་པར་བཏགས་པ་ཡང་རབ་ཏུ་མཁྱེན་ཏེ།
en: He correctly understands how the blessed buddhas were named.

source: འདི་ལྟ་སྟེ་དཔེར་ན། འདིར་ཤཱཀྱའི་རིགས་ལས་ཐུབ་པ་འཁྲུངས་པ་ལ། ཤཱཀྱ་ཐུབ་པ་ཞེས་མཚན་བཏགས་པ་དེ་བཞིན་དུ། དེ་བཞིན་གཤེགས་པས་བསྐལ་པ་དེ་དག་དང་། སངས་རྒྱས་དེ་དག་གི་མཚན་བཏགས་པ་རབ་ཏུ་མཁྱེན།
en: For example, to the one who was born as a leader among the Śākya tribe, the name Śākyamuni was given. Likewise, the Thus-Gone One knows how the names were given throughout the eons to the various buddhas.

source: དེ་བཞིན་གཤེགས་པས་དེར་ཡང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མིང་དུ་བཏགས་པ་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The Thus-Gone One also knows how all beings are named.

source: དེ་བཞིན་གཤེགས་པ་སྔོན་གྱི་མཐའ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the past,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་སྔོན་གྱི་གནས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of past existences.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་བསྐལ་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་དག་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands an inexpressible number of inexpressible eons.

source: གང་དུ་བདག་ཡུན་རིང་པོར་གནས་ཤིང་། དེ་ནས་ཀྱང་སྔོན་གྱི་གནས་གང་ལ་ཕྱིར་ཞིང་གནས་པ། གལ་ཏེ་སེམས་ཅན་དམྱལ་བར་རམ། གལ་ཏེ་དུད་འགྲོའི་སྐྱེ་གནས་སུའམ། གལ་ཏེ་གཤིན་རྗེའི་འཇིག་རྟེན་དུའམ། གལ་ཏེ་མིར་རམ། གལ་ཏེ་ལྷར་རམ། གལ་ཏེ་ཡི་དགས་སུའམ།
en: [He correctly understands] where and when beings lived in past existences, whether in hell, the animal realm, the realm of the Lord of Death; or as a human, god, or starving spirit;

source: གལ་ཏེ་སེང་གེར་རམ། གལ་ཏེ་སྟག་ཏུའམ། གལ་ཏེ་གཟིག་ཏུའམ། གལ་ཏེ་ནམ་མཁའ་ལ་རྒྱུ་བར་རམ། གལ་ཏེ་བྱའི་ཚོགས་སུའམ། གལ་ཏེ་སྦྲུལ་གདུག་པའི་ཚོགས་སུའམ། གལ་ཏེ་སྦྲུལ་གྱི་ཚོགས་སུའམ། གལ་ཏེ་སྲེ་མོའི་ཚོགས་སུ་འམ། གལ་ཏེ་ས་ལ་རྒྱུ་བར་རམ། གལ་ཏེ་བར་སྣང་ལ་རྒྱུ་བར་རམ།
en: [He correctly understands where and when beings lived in past existences, whether] as a lion, tiger, leopard, a being that courses the sky, a bird, a poisonous snake, a serpent, a bear, a being that courses the earth, or a being that courses empty space;

source: གལ་ཏེ་རྐང་མེད་དུའམ། གལ་ཏེ་རྐང་གཉིས་པར་རམ། གལ་ཏེ་རྐང་བཞི་པར་རམ། གལ་ཏེ་རྐང་མངས་སུའམ། གལ་ཏེ་ཆུ་ལ་རྒྱུ་བར་རམ། གལ་ཏེ་སྐམས་ལ་རྒྱུ་བར་རམ། གལ་ཏེ་གནོད་སྦྱིན་གྱི་ཚོགས་སུའམ། གལ་ཏེ་ཤ་ཟའི་ཚོགས་སུའམ། གལ་ཏེ་སྲིན་པོའི་ཚོགས་སུའམ། གལ་ཏེ་འབྱུང་པོའི་ཚོགས་སུའམ། གལ་ཏེ་ལྷ་མ་ཡིན་གྱི་ཚོགས་སུའམ། གལ་ཏེ་ནམ་མཁའ་ལྡིང་གི་ཚོགས་སུའམ། གལ་ཏེ་མིའམ་ཅིའི་ཚོགས་སུའམ། གལ་ཏེ་ལྟོ་འཕྱེ་ཆེན་པོའི་ཚོགས་སུའམ། གལ་ཏེ་མི་མ་ཡིན་པའི་ཚོགས་སུའམ།
en: [He correctly understands where and when beings lived in past existences, whether ...] or as a being with no legs, two legs, four legs, or many legs; or as a being that courses through water, a being that courses over dry land, or a being born as a yakṣa, piśāca, rākṣasa, bhūta, demigod, garuḍa, kiṁnara, mahoraga, or a non-human;

source: གལ་ཏེ་ཕྲེང་བ་འཆང་བའི་ཚོགས་སུའམ། གལ་ཏེ་ལག་ན་གཞོང་ཐོགས་ཀྱི་ལྷར་རམ། གལ་ཏེ་རྟག་ཏུ་མྱོས་པའི་ལྷར་རམ། གལ་ཏེ་ལུས་རྒྱན་ཐོགས་པའི་ལྷར་རམ། གལ་ཏེ་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷར་རམ། གལ་ཏེ་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷར་རམ། གལ་ཏེ་འཐབ་བྲལ་གྱི་ལྷ་ནས་དེ་བཞིན་དུ་སྦྱར་ཏེདགའ་ལྡན་དུའམ། གལ་ཏེ་འཕྲུལ་དགར་རམ། གལ་ཏེ་གཞན་འཕྲུལ་དབང་བྱེད་དུའམ།
en: [He correctly understands where and when beings lived in past existences, whether ...] or as a god who bears a garland, a god who proffers a vessel, a god who is always intoxicated, a god who stands upright, or a god in the Heaven of the Four Great Kings, the Heaven of the Thirty-Three, the Heaven Free from Strife, the Heaven of Joy, the Heaven of Delighting in Emanations, or the Heaven of Making Use of Others’ Emanations;

source: གལ་ཏེ་ཚངས་པར་རམ། གལ་ཏེ་ཚངས་རིས་སུའམ། གལ་ཏེ་ཚངས་པ་མདུན་ན་འདོན་དུའམ། གལ་ཏེ་ཚངས་པ་ཀུན་འཁོར་དུའམ། གལ་ཏེ་ཚངས་པ་ཆེན་པོར་རམ། གལ་ཏེ་འོད་དུའམ། གལ་ཏེ་འོད་ཆུང་ངུའམ། གལ་ཏེ་ཚད་མེད་འོད་དུའམ། གལ་ཏེ་འོད་གསལ་དུའམ། གལ་ཏེ་དགེ་བར་རམ། ཆུང་དགེར་རམ། ཚད་མེད་དགེར་རམ། དགེ་རྒྱས་སུའམ། ཆེ་བར་རམ། ཆུང་ཆེར་རམ། ཚད་མེད་ཆེར་རམ། འབྲས་བུ་ཆེ་བར་རམ། འདུ་ཤེས་མེད་པའི་སེམས་ཅན་དུའམ། གལ་ཏེ་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་དུའམ། གལ་ཏེ་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དུའམ། གལ་ཏེ་ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་དུའམ། གལ་ཏེ་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་དུ་སྟེ།
en: [He correctly understands where and when beings lived in past existences, whether ...] or as Brahmā, or in the Brahmā Realm, the Heaven of the High Priests of Brahmā, the Heaven of the Retinue of Brahmā, the Heaven of Great Brahmā, the Heaven of Light, the Heaven of Limited Light, the Heaven of Limitless Light, the Luminous Heaven, the Heaven of Virtue, the Heaven of Limited Virtue, the Heaven of Limitless Virtue, the Heaven of Perfected Virtue, the Greater Heaven, the Heaven of Lesser Greatness, the Heaven of Limitless Greatness, or the Heaven of Great Fruition; or as a being with no consciousness; or as a being in the sphere of limitless space, the sphere of limitless consciousness, the sphere of nothing whatsoever, or the sphere of neither notion nor no notion.

source: དེ་བཞིན་གཤེགས་པས་འདས་པའི་དུས་ཀྱི་དགེ་བའི་རྩ་བ་གང་དག་མངོན་པར་འདུས་བྱས་པ། གལ་ཏེ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། སོ་སོ་ཡང་དག་པར་ལྡན་པའམ། གལ་ཏེ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་སོ་སོ་ཡང་དག་པར་ལྡན་པའམ། གལ་ཏེ་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། སོ་སོ་ཡང་དག་པར་ལྡན་པའམ། གལ་ཏེ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། སོ་སོ་ཡང་དག་པར་ལྡན་པའམ། གལ་ཏེ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། སོ་སོ་ཡང་དག་པར་ལྡན་པའམ། གལ་ཏེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། སོ་སོ་ཡང་དག་པར་ལྡན་པ་དེ་དག་ཐམས་ཅད་རབ་ཏུ་མཁྱེན།
en: The Thus-Gone One correctly understands all roots of virtue that have been formed in the past, whether involving the perfection of generosity, or the perfection of discipline, or the perfection of patience, or the perfection of diligence, or the perfection of concentration, or the perfection of insight.

source: དེ་བཞིན་གཤེགས་པས་འདས་པའི་དུས་སུ་འཁོར་བ་གང་དག་ལ་གནས་ནས། གང་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ངེས་པར་གནས་པ་དེ་དག་ལ་བསྙེན་བཀུར་བྱས་ཤིང་། ཡོངས་སུ་ཞུས་ནས་མཁྱེན་པ་གང་དག་བསྒྲུབས་པ་འདི་ལྟ་སྟེ། ཐབས་ལ་མཁས་པ་དང་། བཟོའི་ཤེས་པ་དང་། སྙོམས་པར་འཇུག་པའི་ཤེས་པ་བསྒྲུབས་པ་དེ་དང་དེ་དག་ཐམས་ཅད་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The Thus-Gone One correctly understands precisely where in saṃsāra beings have lived, which blessed buddhas they have served, and what type of knowledge they have gained upon receiving instruction, as well as the skills they learned, their practical knowledge, and their accomplishments in terms of equilibrium.

source: ཟག་པ་ཟད་པ་ཤེས་པ་མ་གཏོགས་པར་བཟོའམ། བཟོ་ཤེས་པའམ། ལས་སམ། ལས་ཤེས་པ་གང་དག་དེ་བཞིན་གཤེགས་པས་སྔོན་མ་བསྐྱེད་པ་མེད་དེ། སྔོན་མངོན་པར་འདུས་མ་བྱས་པ་གང་ཡང་མེད་དོ། །
en: Not only does he know the exhaustion of defilements, there is also no skill or knowledge of skill, karma or knowledge of karma, that the Thus-Gone One has not previously produced.

source: དེ་ལྟ་བས་ན་འདིར་གང་གི་ཡེ་ཤེས་མཐོང་བ་ཐོགས་པ་མེད་པར་འཇུག་པ་དེ་ནི་ཙན་དན་གྱི་ཁྱམས་དང་ཁང་བཟངས་ཀྱི་བར་འདི་ལ་ལོངས་སྤྱོད་པར་འགྱུར་རོ། །
en: Therefore, as his wisdom vision is unimpeded, he will enjoy this temple with its sandalwood courtyard.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཕྱི་མའི་མཐའ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the future.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་མ་འོངས་པའི་བསྐལ་པའི་སངས་རྒྱས་རྣམས་དང་། སེམས་ཅན་རྣམས་ཀྱི་མིང་དུ་བཏགས་པ་རབ་ཏུ་མཁྱེན།
en: Householder, the Thus-Gone One correctly understands what the buddhas and beings of the future eons will be called.

source: རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་། སེམས་ཅན་དེ་རྣམས་ཀྱི་མིང་དུ་བཏགས་པར་འགྱུར་བ་དེ་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The Thus-Gone One correctly understands all the causes and conditions for the naming of the future blessed buddhas and beings.

source: དེ་བཞིན་གཤེགས་པ་ཕྱི་མའི་མཐའ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the future,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་འཆི་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of death.

source: སེམས་ཅན་གང་དག་སྐྱེས་ནས་འཆི་བར་འགྱུར་བ།
en: Whoever is born will also die.

source: འཆི་བ་དང་། འཆི་འཕོ་བ་དང་། འཆི་བར་བྱེད་པ་དང་། གསོད་པ་དང་། དུས་བྱེད་པ་དང་། ཕུང་པོ་འཇིག་པ་དང་། ལུས་འདོར་བ་དང་། སྲོག་གི་དབང་པོ་ཡང་དག་པར་གཅོད་པ་དང་། རིས་ལྷན་ཅིག་འཐུན་པ་འབྱེད་པ། དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ
en: The Thus-Gone One correctly understands death, transmigration, killing, slaying, expiring, the perishing of the aggregates, the abandonment of the body, the interruption of the life force, and the separation from one’s family.

source: སེམས་ཅན་འདི་དག་ནི་ཚེའི་ཚད་ཡོངས་སུ་མ་རྫོགས་པར་འཆི་བར་འགྱུར།
en: [He can tell,] ‘These beings will die although their lifespan is not exhausted.

source: སེམས་ཅན་འདི་དག་ནི་ཕ་རོལ་གྱི་གནོད་པས་འཆི་བར་འགྱུར།
en: These beings will die because of harm inflicted by others.

source: སེམས་ཅན་འདི་དག་ནི་ཡ་ང་བ་སྤོང་བས་འཆི་བར་འགྱུར།
en: These beings will die because they reject fighting.

source: སེམས་ཅན་འདི་དག་ནི་ཡ་ང་བ་མ་སྤངས་པས་འཆི་བར་འགྱུར།
en: These beings will die because they do not reject fighting.

source: སེམས་ཅན་འདི་དག་ནི་དུས་ཚིགས་ཀྱིས་བསྒྱུར་ནས་འཆི་བར་འགྱུར།
en: These beings will die because of the passing of time.

source: སེམས་ཅན་འདི་དག་ནི་བསོད་ནམས་ཟད་པས་འཆི་བར་འགྱུར་རོ། །
en: These beings will die because their merit is exhausted.’

source: ཞེས་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་འཆི་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: In this way the Thus-Gone One correctly understands death.

source: དེ་བཞིན་གཤེགས་པ་འཆི་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of death,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སྐྱེ་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of birth.

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་འཆི་བ་ན། སྐྱེ་བའི་མཚན་མ་འདི་དག་འབྱུང་བར་འགྱུར་ཏེ།
en: [He can tell,] ‘When a noble son or daughter dies, particular signs of birth will appear.

source: གང་དུ་འདིས་སྐྱེ་བར་བྱེད་པ་སེམས་ཅན་དམྱལ་བའི་མཚན་མ་དག་མཐོང་བ་ནི་སེམས་ཅན་དམྱལ་བར་འགྲོའོ། །
en: As they are about to be reborn, when the features of hell are witnessed, they will be born in hell.

source: དུད་འགྲོའི་མཚན་མ་དག་མཐོང་བ་ནི་དུད་འགྲོའི་སྐྱེ་གནས་སུ་འགྲོའོ། །
en: When the features of the animal realm are witnessed, that person will be born in the animal realm.

source: གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་མཚན་མ་དག་མཐོང་བ་ནི་གཤིན་རྗེའི་འཇིག་རྟེན་དུ་འགྲོའོ། །
en: When the features of the realm of the Lord of Death are witnessed, that person will be born in the realm of the Lord of Death.

source: མིའི་མཚན་མ་དག་མཐོང་བ་ནི་མིའི་འཇིག་རྟེན་དུ་འགྲོའོ། །
en: When the features of humans are witnessed, that person will be born in the human realm.

source: ལྷའི་མཚན་མ་དག་མཐོང་བ་ནི་མཐོ་རིས་སུ་འགྲོའོ། །
en: When the features of the gods are witnessed, that person will be born in the higher realms.

source: མི་སྐྱེ་བའི་མཚན་མ་དག་མཐོང་བ་ནི་མྱ་ངན་ལས་འདས་པར་འགྲོའོ་ཞེས།
en: When the features of no birth are witnessed, that person will proceed to nirvāṇa.’

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སྐྱེ་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, In this way the Thus-Gone One correctly understands birth.

source: དེ་བཞིན་གཤེགས་པ་སྐྱེ་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of birth,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་འདོད་པའི་ཟག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the defilement of desire.

source: འདོད་པའི་ཟག་པ་ནི་ཡོངས་སུ་རྟོག་པ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་དང་བྲལ་བ་ཡང་དག་པ་མ་ཡིན་པ།
en: The defilement of desire results from thinking, lacks inherent existence, and is inauthentic.

source: སོ་སོ་ཉེ་བར་གཞོག་པ། དགེ་བའི་རྩ་བ་རྣམ་པར་འཇིག་པར་བྱེད་པ།
en: It destroys one’s mental composure and all roots of virtue.

source: བཅིངས་པ་ལྷོད་ཀྱང་རབ་ཏུ་ཐར་བར་དཀའ་བ་
en: Even if one’s fetters are loosened, it is hard to avoid.

source: མི་བཤེས་ཀྱང་བཤེས་པ་ལྟར་སྣང་བ།
en: Although [the defilement of desire] is not desirable, it appears to be.

source: བར་དུ་གཅོད་པར་བྱེད་པ་མི་འཐུན་པ་རྣམ་པ་དུ་མ་དག་ཏུ་མཚུངས་པའོ། །
en: It creates obstacles and functions by assembling many discordant factors.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་དང་། གསལ་བ་དང་། མངོན་པར་རྟོགས་པ་དང་། ཡང་དག་པར་ཁོང་དུ་ཆུད་པ་དང་། མཁས་པ་གང་ཡིན་པ་འདི་ནི་འདོད་པའི་ཟག་པ་ཤེས་པ་ཞེས་བྱ་སྟེ
en: To know, see, perceive, realize, understand, and be skillful about this is called knowing the defilement of desire .

source: ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: That is what the Thus-Gone One correctly understands.

source: དེ་བཞིན་གཤེགས་པ་འདོད་པའི་ཟག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the defilement of desire,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སྲིད་པའི་ཟག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the defilement of existence.

source: སྲིད་པ་ལ་སྲེད་པ་དང་། སྲིད་པ་ལ་རྟག་ཏུ་མངོན་པར་དགའ་བ་དང་། སྲིད་པའི་བྱ་བ་ལ་ཆགས་པ་དང་། སྲིད་པ་ལ་རོ་མྱང་བར་བལྟས་པ་དང་། སྲིད་པ་གང་གི་དབང་གིས་སྔོན་གྱི་མཐའ་མ་ཤེས་ཏེ
en: It is to crave for existence, continuously delight in existence, be attracted to the functions of existence, and to consider existence as appetizing. It is to be ignorant about the past because of the influence of existence.

source: སྡུག་བསྔལ་ཉམས་སུ་མྱོང་ལ་སྲིད་པ་དེའི་སྡུག་བསྔལ་ལ་ཆགས་ཤིང་རབ་ཏུ་མི་ཤེས། སྡུག་བསྔལ་སྤང་བ་རབ་ཏུ་མི་ཤེས་པའོ། །
en: It is an experience of suffering, an attraction to the suffering of existence, and an ignorance about it. It is not knowing how to abandon suffering.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་ནས་མཁས་པའི་བར་གང་ཡིན་པ་འདི་ནི་སྲིད་པའི་ཟག་པ་ཤེས་པ་ཞེས་བྱ་སྟེ།
en: To know, see, . . . and be skillful about this is called knowing the defilement of existence .

source: དེ་བཞིན་གཤེགས་པ་སྲིད་པའི་ཟག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the defilement of existence,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ལྟ་བའི་ཟག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the defilement of views.

source: ལམ་གོལ་བར་ཞུགས་པ་ནི་འདི་དག་ཡིན་ཏེ། འདི་ལྟ་སྟེ། ཆད་པར་ལྟ་བ་དང་། རྟག་པར་ལྟ་བའོ། །
en: It is to be on an errant path, such as that of the view of disruption and the view of permanence.

source: གང་ཆད་པའི་ཆོས་དེ་གང་ཡང་མེད་ཅིང་། གང་འཇིག་རྟེན་འདི་ནས་འཇིག་རྟེན་ཕ་རོལ་ཏུ་འཕོ་བའི་ཆོས་དེ་ཡང་མི་དམིགས་ཏེ།
en: Because a phenomenon that is disrupted would be nothing whatsoever, and a phenomenon that passes from one life to the next cannot be observed.

source: གཞན་དུ་ན་ལས་ཚོགས་པ་དག་གིས་སྐྱེ་སྟེ།
en: In fact, however, birth occurs due to the accumulations of karma.

source: ཁྱིམ་བདག་འདི་ལྟ་སྟེ་དཔེར་ན། ཆུ་ཆེན་པོ་འབབ་པ་ན་སྒྲ་འབྱུང་ལ།
en: Householder, think of the sound of a great waterfall.

source: དེའི་སྒྲ་འབྱུང་བ་ལ་བྱེད་པ་པོ་སུ་ཡང་མེད་དེ།
en: Its sound is not created by anyone at all.

source: གཞན་དུ་ན་ཚོགས་པའི་སྦྱོར་བས་འབྱུང་ངོ་། །
en: Rather, it appears due to an assembly of things.

source: ཁྱིམ་བདག་དེ་བཞིན་དུ་རྐྱེན་ཡོད་ན། འཁོར་བའི་རྒྱུན་དུ་འཇུག་སྟེ།
en: Householder, in the same way, when circumstances come together, they lead to the continuity of saṃsāra.

source: ཉོན་མོངས་པ་དག་ཡོད་ན་ལས་བྱེད་ལ།
en: When there are disturbing emotions, karma is formed.

source: ལས་ཡོད་ན་རྣམ་པར་སྨིན་པ་མངོན་པར་འགྲུབ་ཅིང་འདིར་སོ་སོར་མྱོང་བར་མངོན་པར་འདུ་བྱེད་པ་གང་ཡང་མེད་དེ།
en: When there is karma, there is the formation of karmic ripening, but this individual experience is not created by anyone.

source: གཞན་དུ་ན་རྐྱེན་དེ་དག་ཡོད་ཅིང་ཚོགས་པས་འགྲུབ་བོ། །
en: Rather, it is simply formed when such circumstances come together.

source: དེ་ལ་བུས་པ་ཐོས་པ་དང་མི་ལྡན་པ་སོ་སོའི་སྐྱེ་བོ་དག་འདི་སྙམ་དུ་སེམས་ཏེ།
en: When a child is deaf, an ordinary person may think,

source: ངས་ལས་འདི་མངོན་པར་འདུ་བྱས་པ་གང་ངའི་རྣམ་པར་སྨིན་པ། སོ་སོ་ཡང་དག་པར་མྱང་བར་བྱའོ་ཞེས་
en: ‘I have created this karma, it is ripening on me, so I must also experience it.’

source: དེ་ལྟར་ང་རྒྱལ་ལ་མངོན་པར་ཞེན་པ་ཡོད་པས་འཁོར་བའི་རྒྱུན་མི་འཆད་དོ། །
en: Being attached to the sense of self in this way, the continuity of saṃsāra remains unbroken.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་ནས་མཁས་པའི་བར་གང་ཡིན་པ་འདི་ནི་ལྟ་བའི་ཟག་པ་ཤེས་པ་ཞེས་བྱ་སྟེ།
en: To know, see, . . . and be skillful about this is called knowing the defilement of views .

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ལྟ་བའི་ཟག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, in this way the Thus-Gone One correctly understands the defilement of views.

source: དེ་བཞིན་གཤེགས་པ་ལྟ་བའི་ཟག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the defilement of views,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་མ་རིག་པའི་ཟག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the defilement of ignorance.

source: མ་རིག་པ་ནི་ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་བ་ལ་སྒྲིབ་པ་དང་། ཆོད་པ་དང་། མུན་པ་དང་། མིག་མ་ཡིན་པར་བྱེད་པ་དང་། ཤེས་རབ་འགོག་པ་དང་། ཕོངས་པའི་ཕྱོགས་དང་། མྱ་ངན་ལས་འདས་པར་ཡང་དག་པར་འཇུག་པར་མི་བྱེད་པའོ། །
en: Ignorance is to be obscured regarding the correct outlook, and to be hazy, dimmed, and unclear about it. One’s insight is blocked, one is unfortunate, and one is unable to approach nirvāṇa.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་ནས་མཁས་པའི་བར་གང་ཡིན་པ་འདི་ནི་མ་རིག་པའི་ཟག་པ་ཞེས་བྱ་སྟེ།
en: To know, see, . . . and be skillful about this is called knowing the defilement of ignorance .

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་མ་རིག་པའི་ཟག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, in this way the Thus-Gone One correctly understands the defilement of ignorance.

source: དེ་བཞིན་གཤེགས་པ་མ་རིག་པའི་ཟག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the defilement of ignorance,
